[
    {
        "year": "Creation",
        "desc": "In the begining God created everything, we call this Creation.  (Event)"
    },
    {
        "year": "750 BC",
        "desc": "The Greek empire valued perfection killed or left the less than perfect individuals to the elements.  (Event)"
    },
    {
        "year": "146 BC",
        "desc": "The fall of Greece to the Romans and the rise of the Roman empire. the Romans acted much like the Greeks in their policy towards the disabled.  (Event)"
    },
    {
        "year": "0 BC",
        "desc": "Jesus' birth, Jesus showed compassion to the disabled and sinful healing them of their eniquities.  (Individual)"
    },
    {
        "year": "30",
        "desc": "Jesus gathered the Desiples to himself and started to teach them. The Desiples helped show compassion to those in need.  (Individual)"
    },
    {
        "year": "1474",
        "desc": "Ponce de Leon, a priest who taught Spanish nobility's deaf children so they could inherit.  (Individual)"
    },
    {
        "year": "1454",
        "desc": "Gutenberg movable printing press made it easier to make books for educating the deaf.  (Institution)"
    },
    {
        "year": "1535",
        "desc": "The first English Bible printed.  (Document)"
    },
    {
        "year": "1712",
        "desc": "Abbe de l'Epee, The Father of the deaf, French priest who founded the first free school for the deaf.  (Individual)"
    },
    {
        "year": "1727",
        "desc": "Samuel Heinicke was a German who established the first oral school for the deaf.  (Individual)"
    },
    {
        "year": "1742",
        "desc": "Sicard, de l'Epee's student who took over running the school.  (Individual)"
    },
    {
        "year": "1772",
        "desc": "Jean Massieu, deaf and taught Laurent Clerc.  (Individual)"
    },
    {
        "year": "1785",
        "desc": "Laurent Clerc, a deaf Frenchman who studied under Jean Massieu, met Gallaudet and came to America to help establish the first deaf school in America.  (Individual)"
    },
    {
        "year": "1787",
        "desc": "Rev. Thomas Gallaudet, Congregational minister who traveled to England and France to learn how to teach Deaf. Helped establish the first deaf school in America.  (Individual)"
    },
    {
        "year": "1837",
        "desc": "Edward Miner Gallaudet, Thomas's son. continued the work of his father and the president of Gallaudet College.  (Individual)"
    },
    {
        "year": "1880",
        "desc": "The Second International Congress on Education of the Deaf was held in Italy and was a large meeting of educators of the deaf. They discused the best ways of education oral or sign. The meeting was stacked in favor of the oralists and caused the number of deaf toeachers in following years to shrink.  (Event)"
    },
    {
        "year": "1964",
        "desc": "Registry of Interpreters for the Deaf established, before this anyone could interpret for any situation regardless of skill level.  (Institution)"
    },
    {
        "year": "1975",
        "desc": "PL 94-142- Mainstreaming law passed to have handicapped children taught in the least restrictive inviroment possible.  (Event)"
    },
    {
        "year": "2020",
        "desc": "Bible translated to ASL. The ASLV.  (Document)"
    }
]